Revit 2027 API
TopographySurface.FindPoints Method
 Filters and returns only the points of the topography surface which lie within the input bounding box.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<XYZ> FindPoints(
	Outline boundingBox
)
Public Function FindPoints (
	boundingBox As Outline
) As IList(Of XYZ)
public:
IList<XYZ^>^ FindPoints(
	Outline^ boundingBox
)
member FindPoints :
        boundingBox : Outline -> IList<XYZ>
Parameters
boundingBox Outline
 The 3D bounding box.
Return Value
IList<XYZ>
 The result points within the 3D bounding box
Exceptions
Exception | Condition
ArgumentException |  boundingBox is an empty Outline.
ArgumentNullException |  A non-optional argument was null
Remarks
 This applies to TopographySurface, SiteSubRegion, and the topography surface associated with a BuildingPad element.
See Also
Reference
TopographySurface Class
Autodesk.Revit.DB.Architecture Namespace